Revit 2024 API
BuiltInFailures.MEPFabricationFailures.InvalidConnectionsHaveBeenDisconnected Property
 Invalid connections have been disconnected. Please reconnect them manually or use different fittings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidConnectionsHaveBeenDisconnected { get; }
Visual Basic
Public Shared ReadOnly Property InvalidConnectionsHaveBeenDisconnected As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidConnectionsHaveBeenDisconnected {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace